# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
df=[4,8,15,16,23,42]

In [2]:
import pandas as pd

In [6]:
df1=pd.Series(df)

In [7]:
type(df1)

pandas.core.series.Series

In [8]:
df1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [13]:
df2=[i for i in range(1,11)]

In [14]:
df2

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [15]:
df3=pd.Series(df2)

In [16]:
df3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:

In [17]:
"""
Name              Age                 Gender
Alice              25                 Female
Bob                30                 Male
Claire             27                 Female

"""

'\nName              Age                 Gender\nAlice              25                 Female\nBob                30                 Male\nClaire             27                 Female\n\n'

In [20]:
data={
"Name":['Alice ','Bob','Claire'],
"Age":[25 ,30,27],
"Gender":['Female','Male','Female']
}

In [30]:
df4=pd.DataFrame(data)

In [31]:
df4

     Name  Age  Gender
0  Alice    25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.

1)Series are 1-D, whereas Dataframe are 2-D. 2)Series consists of homogeneous data, whereas dataframe consists of heterogeneous data. 3)series are value mutable whereas dataframe are no

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Key Features of Pandas:

Perform Group by operation seamlessly,

Datasets are mutable using pandas which means we can add new rows and columns to them.,

Easy to handle missing data,

Merge and join datasets,

Indexing and subsetting data

In [36]:
import pandas as pd
path_to_data = 'titanic_data.csv'
# read the csv data using pd.read_csv function
data = pd.read_csv(path_to_data)
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [38]:
# Drop multiple columns using the following code,

df_dropped_multiple = data.drop(['Survived', 'Name'], axis=1)
df_dropped_multiple.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,3,male,35.0,0,0,373450,8.0500,NaN,S

In [39]:
#Drop multiple rows using the following code,

df_row_dropped_multiple = data.drop([2, 3], axis=0)
df_row_dropped_multiple.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [41]:
#Renaming a column in the dataset
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [42]:
df_renamed = data.rename(columns={'PassengerId': 'Id'})
df_renamed.head()

,Id,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans.All Pandas data structures are value mutable (can be changed) and except Series all are size mutable.

Panel: It is a 3-D, size-mutable array.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [43]:
# import pandas library
import pandas as pd

# create a series
a = pd.Series(["C++", "JAVA","PYTHON", "DBMS","C#"], name = "subjects")

# create a series
b = pd.Series(["30", "60","90", "56","50"], name = "marks")

# merge both series
df = pd.merge(a, b, right_index = True,left_index = True)
# show the dataframe
df

  subjects marks
0      C++    30
1     JAVA    60
2   PYTHON    90
3     DBMS    56
4       C#    50